//2 Напишите программу, которая на вход принимает 
//два числа и выдает, какое число большее, а какое меньшее.
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число"); 
// int number2 = Convert.ToInt32(Console.ReadLine());
//  Console.Write("max= ");
// if(number1>number2) 
// {
//     Console.WriteLine(number1);
// }
// else
// {
//    Console.WriteLine(number2); 
// }

// 4 Напишите программу, которая принимает на вход 
//три числа и выдает максимальное из этих чисел.
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число"); 
// int number2 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число");
// int number3 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число");
// Console.Write("max= ");
// int max = number1;
// if (number2>max) max=number2;
// if (number3>max) max=number3;
// Console.WriteLine(max);

// 6 Напишите программу, которая на вход принимает число и выдает, 
// является ли число четным (делится ли оно на два без остатка).
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine());
// double result = number1%2;

// if(result==0)
// {
//     Console.WriteLine("да");
// }
// else
// {
//     Console.WriteLine("нет");
// }

// 8  Напишите программу, которая на вход принимает число (N), 
//а на выходе показывает все чётные числа от 1 до N.
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine());
// int Num = 1;
// double result = 0;
// Console.WriteLine("Ответ");
// while (Num<=number1)
// {
//     result = Num%2;
//     if(result==0)
//     {
//      Console.WriteLine(Num);
//     }
//     Num = Num + 1;
// }  
