//2 Напишите программу, которая на вход принимает 
//два числа и выдает, какое число большее, а какое меньшее.
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число"); 
// int number2 = Convert.ToInt32(Console.ReadLine());
//  Console.Write("max= ");
// if(number1>number2) 
// {
//     Console.WriteLine(number1);
// }
// else
// {
//    Console.WriteLine(number2); 
// }

// 4 Напишите программу, которая принимает на вход 
//три числа и выдает максимальное из этих чисел.
// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число"); 
// int number2 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число");
// int number3 = Convert.ToInt32(Console.ReadLine()); 
// Console.WriteLine("Введите число");
// Console.Write("max= ");
// int max = number1;
// if (number2>max) max=number2;
// if (number3>max) max=number3;
// Console.WriteLine(max);

// 6 Напишите программу, которая на вход принимает число и выдает, 
// является ли число четным (делится ли оно на два без остатка).
