// See https://aka.ms/new-console-template for more information
//Console.WriteLine("Hello, World!");

//Напишите программу, которая принимает на вход трёхзначное число 
//и на выходе показывает вторую цифру этого числа.

// Console.WriteLine("Введите число"); 
// int number1 = Convert.ToInt32(Console.ReadLine());

// int a =  number1/100;
// int d =  number1/10; 
// int result = d-a*10 ;

// Console.WriteLine(result);

